IDEA StatiCa Open Model
ConcreteBlockData.Depth Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Depth of the concrete block
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double Depth { get; set; }
Public Property Depth As Double
	Get
	Set
public:
property double Depth {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
ConcreteBlockData Class
IdeaRS.OpenModel.Connection Namespace